HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSbcu_regdef.h
/** \\brief  SBCU Debug Trapped Address Register */
typedef struct _Ifx_SBCU_DBADRT_Bits
{
    unsigned int FPIADR:32;                 /**< \brief [31:0] FPIBus Address Status (rh) */
} Ifx_SBCU_DBADRT_Bits;

/** \\brief  SBCU Debug Bus Operation Signals Register */
typedef struct _Ifx_SBCU_DBBOS_Bits
{
    unsigned int OPC:4;                     /**< \brief [3:0] Opcode for Signal Status Debug Trigger (rw) */
    unsigned int SVM:1;                     /**< \brief [4:4] SVM Signal for Status Debug Trigger (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int WR:1;                      /**< \brief [8:8] Write Signal for Status Debug Trigger (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int RD:1;                      /**< \brief [12:12] Write Signal for Status Debug Trigger (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_SBCU_DBBOS_Bits;

/** \\brief  SBCU Debug Trapped Bus Operation Signals Register */
typedef struct _Ifx_SBCU_DBBOST_Bits
{
    unsigned int FPIOPC:4;                  /**< \brief [3:0] FPIBus Opcode Status (rh) */
    unsigned int FPISVM:1;                  /**< \brief [4:4] FPIBus Supervisor Mode Status (rh) */
    unsigned int FPIACK:2;                  /**< \brief [6:5] FPIBus Acknowledge Status (rh) */
    unsigned int FPIRDY:1;                  /**< \brief [7:7] FPIBus Ready Status (rh) */
    unsigned int FPIWR:1;                   /**< \brief [8:8] FPIBus Write Indication Status (rh) */
    unsigned int FPIRST:2;                  /**< \brief [10:9] FPIBus Reset Status (rh) */
    unsigned int FPIOPS:1;                  /**< \brief [11:11] FPIBus OCDS Suspend Status (rh) */
    unsigned int FPIRD:1;                   /**< \brief [12:12] FPIBus Read Indication Status (rh) */
    unsigned int FPIABORT:1;                /**< \brief [13:13] FPIBus Abort Status (rh) */
    unsigned int FPITOUT:1;                 /**< \brief [14:14] FPIBus Time-out Status (rh) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int FPITAG:6;                  /**< \brief [21:16] FPIBus Master TAG Status (rh) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_SBCU_DBBOST_Bits;

/** \\brief  SBCU Debug Control Register */
typedef struct _Ifx_SBCU_DBCNTL_Bits
{
    unsigned int EO:1;                      /**< \brief [0:0] Status of SBCU Debug Support Enable (r) */
    unsigned int OA:1;                      /**< \brief [1:1] Status of SBCU Breakpoint Logic (r) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int RA:1;                      /**< \brief [4:4] Rearm SBCU Breakpoint Logic (w) */
    unsigned int reserved_5:7;              /**< \brief \internal Reserved */
    unsigned int CONCOM0:1;                 /**< \brief [12:12] Grant and Address Trigger Relation (rw) */
    unsigned int CONCOM1:1;                 /**< \brief [13:13] Address 1 and Address 2 Trigger Relation (rw) */
    unsigned int CONCOM2:1;                 /**< \brief [14:14] Address and Signal Trigger Relation (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int ONG:1;                     /**< \brief [16:16] Grant Trigger Enable (rw) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int ONA1:2;                    /**< \brief [21:20] Address 1 Trigger Control (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int ONA2:2;                    /**< \brief [25:24] Address 2 Trigger Control (rw) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int ONBOS0:1;                  /**< \brief [28:28] Opcode Signal Status Trigger Condition (rw) */
    unsigned int ONBOS1:1;                  /**< \brief [29:29] Supervisor Mode Signal Trigger Condition (rw) */
    unsigned int ONBOS2:1;                  /**< \brief [30:30] Write Signal Trigger Condition (rw) */
    unsigned int ONBOS3:1;                  /**< \brief [31:31] Read Signal Trigger Condition (rw) */
} Ifx_SBCU_DBCNTL_Bits;

/** \\brief  SBCU Debug Data Status Register */
typedef struct _Ifx_SBCU_DBDAT_Bits
{
    unsigned int FPIDATA:32;                /**< \brief [31:0] FPIBus Data Status (rh) */
} Ifx_SBCU_DBDAT_Bits;

/** \\brief  SBCU Debug Trapped Master Register */
typedef struct _Ifx_SBCU_DBGNTT_Bits
{
    unsigned int SDMAH:1;                   /**< \brief [0:0] High-Priority SDMA FPIBus Master StatusIncluding SDMA transactions from SDMA channels with high priority and from Cerberus with high priority (rw) */
    unsigned int reserved_1:1;              /**< \brief \internal Reserved */
    unsigned int ETH:1;                     /**< \brief [2:2] Ethernet FPIBus Master Status (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int DMA:1;                     /**< \brief [4:4] DMA FPIBus Master Status (rw) */
    unsigned int SDMAM:1;                   /**< \brief [5:5] Medium-Priority SDMA FPIBus Master StatusIncluding DMA transactions from DMA channels with medium priority (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int CPU0:1;                    /**< \brief [8:8] CPU0 FPIBus Master Status (rw) */
    unsigned int CPU1:1;                    /**< \brief [9:9] CPU1 FPIBus Master Status (rw) */
    unsigned int SFI:1;                     /**< \brief [10:10] SFI Bridge FPIBus Master Status (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int HSMRMI:1;                  /**< \brief [12:12] HSM Register FPIBus Master Interface Status (rw) */
    unsigned int HSMCMI:1;                  /**< \brief [13:13] HSM Cache FPIBus Master Interface Status (rw) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int SDMAL:1;                   /**< \brief [15:15] Low-Priority SDMA FPIBus Master StatusIncluding DMA transactions from DMA channels with low priority, MLI and from Cerberus with low priority (rw) */
    unsigned int SDMACHNR:8;                /**< \brief [23:16] SDMA-FPI Channel Grant Status (rw) */
    unsigned int DMACHNR:8;                 /**< \brief [31:24] DMA-FPI Channel Grant Status (rw) */
} Ifx_SBCU_DBGNTT_Bits;

/** \\brief  SBCU Debug Grant Mask Register */
typedef struct _Ifx_SBCU_DBGRNT_Bits
{
    unsigned int SDMAH:1;                   /**< \brief [0:0] Cerberus Grant Trigger Enable, High PriorityIncluding SDMA transactions from SDMA channels with high priority and from Cerberus with high priority (rw) */
    unsigned int reserved_1:1;              /**< \brief \internal Reserved */
    unsigned int ETH:1;                     /**< \brief [2:2] Ethernet Trigger Enable, High PriorityIncluding SDMA transactions from SDMA channels with high priority and from Cerberus with high priority (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int DMA:1;                     /**< \brief [4:4] DMA Grant Trigger Enable (rw) */
    unsigned int SDMAM:1;                   /**< \brief [5:5] SDMA Grant Trigger Enable, Medium PriorityIncluding SDMA transactions from SDMA channels with medium priority (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int CPU0:1;                    /**< \brief [8:8] CPU0 Grant Trigger Enable (rw) */
    unsigned int CPU1:1;                    /**< \brief [9:9] CPU1 Grant Trigger Enable (rw) */
    unsigned int SFI:1;                     /**< \brief [10:10] SFI Bridge Grant Trigger Enable (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int HSMRMI:1;                  /**< \brief [12:12] HSM Register Master Interface Grant Trigger Enable (rw) */
    unsigned int HSMCMI:1;                  /**< \brief [13:13] HSM Cache Master Interface Grant Trigger Enable (rw) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int SDMAL:1;                   /**< \brief [15:15] DMA Grant Trigger Enable, Low PriorityIncluding SDMA transactions from SDMA channels with low priority, MLI and from Cerberus with low priority (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SBCU_DBGRNT_Bits;

/** \\brief  SBCU Error Address Capture Register */
typedef struct _Ifx_SBCU_EADD_Bits
{
    unsigned int FPIADR:32;                 /**< \brief [31:0] Captured FPIBus Address (rwh) */
} Ifx_SBCU_EADD_Bits;

/** \\brief  SBCU Error Control Capture Register */
typedef struct _Ifx_SBCU_ECON_Bits
{
    unsigned int ERRCNT:14;                 /**< \brief [13:0] FPIBus Error Counter (rwh) */
    unsigned int TOUT:1;                    /**< \brief [14:14] State of FPIBus Time-Out Signal (rwh) */
    unsigned int RDY:1;                     /**< \brief [15:15] State of FPIBus Ready Signal (rwh) */
    unsigned int ABT:1;                     /**< \brief [16:16] State of FPI Bus Abort Signal (rwh) */
    unsigned int ACK:2;                     /**< \brief [18:17] State of FPIBus Acknowledge Signals (rwh) */
    unsigned int SVM:1;                     /**< \brief [19:19] State of FPIBus Supervisor Mode Signal (rwh) */
    unsigned int WRN:1;                     /**< \brief [20:20] State of FPIBus Write Signal (rwh) */
    unsigned int RDN:1;                     /**< \brief [21:21] State of FPIBus Read Signal (rwh) */
    unsigned int TAG:6;                     /**< \brief [27:22] FPIBus Master Tag Number Signals (rwh) */
    unsigned int OPC:4;                     /**< \brief [31:28] FPIBus Operation Code Signals (rwh) */
} Ifx_SBCU_ECON_Bits;

/** \\brief  SBCU Error Data Capture Register */
typedef struct _Ifx_SBCU_EDAT_Bits
{
    unsigned int FPIDAT:32;                 /**< \brief [31:0] Captured FPIBus Data (rwh) */
} Ifx_SBCU_EDAT_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_SBCU_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODNUMBER:8;               /**< \brief [15:8] Module Number Value (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SBCU_ID_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_SBCU_PRIOH_Bits
{
    unsigned int CPU0:4;                    /**< \brief [3:0] Master 8 Priority (rw) */
    unsigned int CPU1:4;                    /**< \brief [7:4] Master 9 Priority (rw) */
    unsigned int SFI:4;                     /**< \brief [11:8] Master 10 Priority (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int HSMRMI:4;                  /**< \brief [19:16] Master 12 Priority (rw) */
    unsigned int HSMCMI:4;                  /**< \brief [23:20] Master 13 Priority (rw) */
    unsigned int reserved_24:4;             /**< \brief \internal Reserved */
    unsigned int SDMAL:4;                   /**< \brief [31:28] Master 15 Priority (rw) */
} Ifx_SBCU_PRIOH_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_SBCU_PRIOL_Bits
{
    unsigned int SDMAH:4;                   /**< \brief [3:0] Master 0 Priority (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int ETH:4;                     /**< \brief [11:8] Master 2 Priority (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int DMA:4;                     /**< \brief [19:16] Master 4 Priority (rw) */
    unsigned int SDMAM:4;                   /**< \brief [23:20] Master 5 Priority (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_SBCU_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sbcu_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ACCEN0_Bits B;
} Ifx_SBCU_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ACCEN1_Bits B;
} Ifx_SBCU_ACCEN1;

/** \\brief  SBCU Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_CON_Bits B;
} Ifx_SBCU_CON;

