HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSbcu_regdef.h
/** \\brief  SBCU Debug Address 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBADR1_Bits B;
} Ifx_SBCU_DBADR1;

/** \\brief  SBCU Debug Address 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBADR2_Bits B;
} Ifx_SBCU_DBADR2;

/** \\brief  SBCU Debug Trapped Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBADRT_Bits B;
} Ifx_SBCU_DBADRT;

/** \\brief  SBCU Debug Bus Operation Signals Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBBOS_Bits B;
} Ifx_SBCU_DBBOS;

/** \\brief  SBCU Debug Trapped Bus Operation Signals Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBBOST_Bits B;
} Ifx_SBCU_DBBOST;

/** \\brief  SBCU Debug Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBCNTL_Bits B;
} Ifx_SBCU_DBCNTL;

/** \\brief  SBCU Debug Data Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBDAT_Bits B;
} Ifx_SBCU_DBDAT;

/** \\brief  SBCU Debug Trapped Master Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBGNTT_Bits B;
} Ifx_SBCU_DBGNTT;

/** \\brief  SBCU Debug Grant Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBGRNT_Bits B;
} Ifx_SBCU_DBGRNT;

/** \\brief  SBCU Error Address Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_EADD_Bits B;
} Ifx_SBCU_EADD;

/** \\brief  SBCU Error Control Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ECON_Bits B;
} Ifx_SBCU_ECON;

/** \\brief  SBCU Error Data Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_EDAT_Bits B;
} Ifx_SBCU_EDAT;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ID_Bits B;
} Ifx_SBCU_ID;

/** \\brief  Arbiter Priority Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_PRIOH_Bits B;
} Ifx_SBCU_PRIOH;

/** \\brief  Arbiter Priority Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_PRIOL_Bits B;
} Ifx_SBCU_PRIOL;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sbcu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  SBCU object */
typedef volatile struct _Ifx_SBCU
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_SBCU_ID ID;                         /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_SBCU_CON CON;                       /**< \brief 10, SBCU Control Register */
    Ifx_SBCU_PRIOH PRIOH;                   /**< \brief 14, Arbiter Priority Register */
    Ifx_SBCU_PRIOL PRIOL;                   /**< \brief 18, Arbiter Priority Register */
    unsigned char reserved_1C[4];           /**< \brief 1C, \internal Reserved */
    Ifx_SBCU_ECON ECON;                     /**< \brief 20, SBCU Error Control Capture Register */
    Ifx_SBCU_EADD EADD;                     /**< \brief 24, SBCU Error Address Capture Register */
    Ifx_SBCU_EDAT EDAT;                     /**< \brief 28, SBCU Error Data Capture Register */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_SBCU_DBCNTL DBCNTL;                 /**< \brief 30, SBCU Debug Control Register */
    Ifx_SBCU_DBGRNT DBGRNT;                 /**< \brief 34, SBCU Debug Grant Mask Register */
    Ifx_SBCU_DBADR1 DBADR1;                 /**< \brief 38, SBCU Debug Address 1 Register */
    Ifx_SBCU_DBADR2 DBADR2;                 /**< \brief 3C, SBCU Debug Address 2 Register */
    Ifx_SBCU_DBBOS DBBOS;                   /**< \brief 40, SBCU Debug Bus Operation Signals Register */
    Ifx_SBCU_DBGNTT DBGNTT;                 /**< \brief 44, SBCU Debug Trapped Master Register */
    Ifx_SBCU_DBADRT DBADRT;                 /**< \brief 48, SBCU Debug Trapped Address Register */
    Ifx_SBCU_DBBOST DBBOST;                 /**< \brief 4C, SBCU Debug Trapped Bus Operation Signals Register */
    Ifx_SBCU_DBDAT DBDAT;                   /**< \brief 50, SBCU Debug Data Status Register */
    unsigned char reserved_54[164];         /**< \brief 54, \internal Reserved */
    Ifx_SBCU_ACCEN1 ACCEN1;                 /**< \brief F8, Access Enable Register 1 */
    Ifx_SBCU_ACCEN0 ACCEN0;                 /**< \brief FC, Access Enable Register 0 */
} Ifx_SBCU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSBCU_REGDEF_H */
